from delta_utils import find_zscores_for_given_words
from delta_plot_utils import display_graph
from pprint import pprint
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.decomposition import PCA

function_words = ['και', 'ο', 'εν', 'δε', 'του', 'εις', 'το', 'τον', 'την', 'η', 'της', 'τω', 'οτι', 'των', 'οι', 'γαρ', 'μη', 'εστιν', 'τη', 'τα', 'ουκ', 'ου', 'τους', 'προς', 'εκ', 'επι', 'ινα', 'τοις', 'ει', 'δια', 'ουν', 'ως', 'απο', 'τι', 'αλλα', 'ην', 'τις', 'τας', 'εαν', 'περι', 'κατα', 'τουτο', 'μετα', 'εξ', 'τε', 'αλλ', 'ταυτα', 'ος', 'ταις', 'ουτως', 'υπο', 'ουτος', 'μεν', 'καθως', 'ον', 'αν', 'εισιν', 'αι', 'υπερ']

# removed: 'θεου', 'ειπεν', 'ιησους', 'ιησου', 'θεος', 'παντα', 'χριστου', 'κυριου', 'λεγω', 'ιδου', 'εγενετο', 'παντες', 'λεγων', 'κυριος', 'πνευμα', 'υιος', 'θεω',

# removed: 'αυτου', 'αυτον', 'αυτω', 'υμιν', 'αυτοις', 'υμων', 'μου', 'αυτων', 'σου', 'υμας', 'ημων', 'αυτους', 'εγω', 'με', 'μοι', 'υμεις', 'σοι', 'αυτη', 'σε', 'συ', 'αυτος', 'ημας', 'ημιν',

book_to_word_zscores = find_zscores_for_given_words(function_words)
display_graph(book_to_word_zscores, 0, 0)
